app/View/Composers/AdminSidebarComposer.php

    protected function getSidebarData()
    {
        $totalUserCount = User::count();
        $adminUserCount = User::role('admin')->count();
        $totalEnrollment = Enrollment::count();
        $totalStudent = Student::count();
        $totalTeacher = Teacher::count();
        $totalGuardian = Guardian::count();
        $totalClasses = SchoolClass::count();
        $totalSections = Section::count();
        $totalExams = Exam::count();
---
select count(*) as aggregate from `users`
select count(*) as aggregate from `enrollments` where `enrollments`.`deleted_at` is null
select count(*) as aggregate from `students` where `students`.`deleted_at` is null
select count(*) as aggregate from `teachers` where `teachers`.`deleted_at` is null
select count(*) as aggregate from `guardians` where `guardians`.`deleted_at` is null
select count(*) as aggregate from `school_classes` where `school_classes`.`deleted_at` is null
select count(*) as aggregate from `sections` where `sections`.`deleted_at` is null
select count(*) as aggregate from `exams` where `exams`.`deleted_at` is null

                'icon' => '📚',
                'label' => 'Subjects',
                'description' => 'Course catalog',
                'badge' => Subject::where('is_active', true)->count(),
---
select count(*) as aggregate from `subjects` where `is_active` = 1

    protected function getQuickStats()
    {
        $totalUserCount = User::count();
        $totalStudent = User::role('student')->count();
        $totalTeacher = User::role('teacher')->count();
        $totalClass = SchoolClass::count();
        $totalUserPending = User::where('status', 'pending')->count();
---
select count(*) as aggregate from `users`
select count(*) as aggregate from `school_classes` where `school_classes`.`deleted_at` is null
select count(*) as aggregate from `users` where `status` = 'pending'