app/View/Composers/QuickStatsComposer.php

    protected function getQuickStats()
    {
        $totalUserCount = User::count();
        $totalStudents = Student::count();
        $totalTeachers = Teacher::count();
        $totalParents = Guardian::count();
        $activeUsers = User::where('status', 'active')->count();
        $pendingUsers = User::where('status', 'pending')->count();
        $inactiveUsers = User::where('status', 'inactive')->count();
---
select count(*) as aggregate from `users`
select count(*) as aggregate from `students` where `students`.`deleted_at` is null
select count(*) as aggregate from `teachers` where `teachers`.`deleted_at` is null
select count(*) as aggregate from `guardians` where `guardians`.`deleted_at` is null
select count(*) as aggregate from `users` where `status` = 'active'
select count(*) as aggregate from `users` where `status` = 'pending'
select count(*) as aggregate from `users` where `status` = 'inactive'

    protected function getRoles()
    {

        return \Spatie\Permission\Models\Role::all();
---
select * from `roles`