app/Http/Controllers/SectionController.php

select * from `sections` where `sections`.`deleted_at` is null order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `sections` where `sections`.`deleted_at` is null
select * from `school_classes` where `school_classes`.`deleted_at` is null
---
    public function index(Request $request)
    {
        $query = Section::with(['class', 'teacher'])
            ->when($request->class_id, function ($q) use ($request) {
                return $q->where('class_id', $request->class_id);
            })
            ->when($request->is_active, function ($q) use ($request) {
                return $q->where('is_active', $request->is_active == 'active');
            })
            ->when($request->search, function ($q) use ($request) {
                return $q->where('name', 'like', "%{$request->search}%")
                    ->orWhere('code', 'like', "%{$request->search}%");
            });

        $sections = $query->latest()->paginate(20);
        $classes = SchoolClass::all();

insert into `sections` (`class_id`, `teacher_id`, `name`, `code`, `description`, `capacity`, `room_number`, `is_active`, `updated_at`, `created_at`) values ('2', null, 'Fitzgerald Copeland', 'SEC-01', 'Quia est mollit cor', '77', '357', '1', '2026-01-04 16:24:11', '2026-01-04 16:24:11')
---
    public function store(Request $request)
    {
        $validated = $request->validate([
            'class_id' => 'required|exists:school_classes,id',
            'teacher_id' => 'nullable|exists:teachers,id',
            'name' => 'required|string|max:100',
            'code' => 'required|string|unique:sections,code|max:10',
            'description' => 'nullable|string',
            'capacity' => 'required|integer|min:1|max:100',
            'room_number' => 'required|string|min:1|max:1000',
            'is_active' => 'boolean'
        ]);

        try {
            DB::beginTransaction();

            Section::create($validated);