app/Models/Guardian.php

select count(*) as aggregate from `students` inner join `guardian_student` on `students`.`id` = `guardian_student`.`student_id` where `guardian_student`.`guardian_id` = 3 and `students`.`deleted_at` is null
---
    public function getStudentsCountAttribute()
    {
        return $this->students()->count();