app/Models/SchoolClass.php

select count(*) as aggregate from `students` where `students`.`class_id` = 2 and `students`.`class_id` is not null and `students`.`deleted_at` is null
---
    public function getEnrolledCountAttribute(): int
    {
        return $this->students()->count();