app/Models/Section.php

    public static function generateSectionCode(): string
    {
        // Get all existing section codes
        $existingCodes = static::pluck('code')->toArray();
---
select `code` from `sections` where `sections`.`deleted_at` is null

    public static function generateRoomNumber($roomType = 'classroom'): string
    {
        // Room type prefixes
        $prefixes = [
            'classroom' => 'CR',
            'laboratory' => 'LAB',
            'library' => 'LIB',
            'auditorium' => 'AUD',
            'office' => 'OFF',
            'sports' => 'GYM',
            'computer' => 'COM',
        ];

        $prefix = $prefixes[$roomType] ?? 'RM';

        // Get last room number for this type
        $lastRoom = static::where('room_number', 'like', $prefix . '-%')
            ->withTrashed()
            ->orderBy('id', 'desc')
            ->first();
---
select * from `sections` where `room_number` like 'CR-%' order by `id` desc limit 1

    public function getRemainingSeatsAttribute()
    {
        $currentStudents = $this->students()->count();
---
select count(*) as aggregate from `students` where `students`.`student_id` = 1 and `students`.`student_id` is not null and `students`.`deleted_at` is null