app/Models/Student.php

    public static function generateStudentId(): string
    {
        $lastStudent = static::withTrashed()->orderBy('id', 'desc')->first();
---
select * from `students` order by `id` desc limit 1

    public static function generateAdmissionNumber(): string
    {
        $year = date('Y');
        $lastStudent = static::withTrashed()->where('admission_number', 'like', 'ADM' . $year . '%')->orderBy('id', 'desc')->first();
---
select * from `students` where `admission_number` like 'ADM2026%' order by `id` desc limit 1