app/Http/Controllers/Admin/ClassManagementController.php

    public function index(Request $request)
    {
        // Query classes WITHOUT the withCount that's causing the error
        $query = SchoolClass::with(['teachers.user']); // Remove 'students.user' for now

        // Apply filters if needed
        if ($request->has('q') && $request->q) {
            $search = $request->q;
            $query->where(function ($q) use ($search) {
                $q->where('name', 'like', "%{$search}%")
                    ->orWhere('code', 'like', "%{$search}%")
                    ->orWhere('room_number', 'like', "%{$search}%");
            });
        }

        if ($request->has('grade_level') && $request->grade_level) {
            $query->where('grade_level', $request->grade_level);
        }

        if ($request->has('status') && $request->status) {
            $query->where('status', $request->status);
        }

        // Paginate with query string
        $classes = $query->paginate($request->per_page ?? 10)
            ->withQueryString();
---
select * from `school_classes` where `school_classes`.`deleted_at` is null limit 100 offset 0
select `teachers`.*, `teacher_class`.`school_class_id` as `pivot_school_class_id`, `teacher_class`.`teacher_id` as `pivot_teacher_id`, `teacher_class`.`subject` as `pivot_subject`, `teacher_class`.`created_at` as `pivot_created_at`, `teacher_class`.`updated_at` as `pivot_updated_at` from `teachers` inner join `teacher_class` on `teachers`.`id` = `teacher_class`.`teacher_id` where `teacher_class`.`school_class_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9) and `teachers`.`deleted_at` is null
select count(*) as aggregate from `school_classes` where `school_classes`.`deleted_at` is null

            try {
                // If using class_id in students table
                if (Schema::hasColumn('students', 'class_id')) {
                    $class->current_strength = Student::where('class_id', $class->id)->count();
---
select count(*) as aggregate from `students` where `class_id` = 1 and `students`.`deleted_at` is null

        });

        // Statistics - FIXED
        $totalClasses = SchoolClass::count();
        $activeClasses = SchoolClass::where('status', 'active')->count();

        // Calculate total students
        $totalStudents = Student::count();
---
select count(*) as aggregate from `school_classes` where `school_classes`.`deleted_at` is null
select count(*) as aggregate from `school_classes` where `status` = 'active' and `school_classes`.`deleted_at` is null
select count(*) as aggregate from `students` where `students`.`deleted_at` is null

        // Calculate average class size
        $totalStudentAssignments = 0;
        if (Schema::hasColumn('students', 'class_id')) {
            $totalStudentAssignments = Student::whereNotNull('class_id')->count();
---
select count(*) as aggregate from `students` where `class_id` is not null and `students`.`deleted_at` is null

        $averageClassSize = $totalClasses > 0 ? $totalStudentAssignments / $totalClasses : 0;

        // Additional statistics
        $maxCapacity = SchoolClass::max('capacity') ?? 100;
---
select max(`capacity`) as aggregate from `school_classes` where `school_classes`.`deleted_at` is null

            }
        }

        $teacherStudentRatio = $totalStudents > 0 ? $totalStudents / Teacher::count() : 0;

        // Growth calculation (compared to last month)
        $lastMonthClasses = SchoolClass::whereMonth('created_at', now()->subMonth()->month)->count();
        $classGrowth = $lastMonthClasses > 0 ? (($totalClasses - $lastMonthClasses) / $lastMonthClasses) * 100 : 0;

        // Grade distribution
        $gradeDistribution = SchoolClass::select('grade_level', DB::raw('count(*) as count'))
            ->groupBy('grade_level')
            ->orderBy('grade_level')
            ->pluck('count', 'grade_level')
            ->toArray();
---
select count(*) as aggregate from `teachers` where `teachers`.`deleted_at` is null
select count(*) as aggregate from `school_classes` where month(`created_at`) = '12' and `school_classes`.`deleted_at` is null
select `grade_level`, count(*) as count from `school_classes` where `school_classes`.`deleted_at` is null group by `grade_level` order by `grade_level` asc

        $upcomingEvents = $this->getUpcomingEvents($totalClasses);

        // Get available teachers for filter
        $teachers = Teacher::with('user')
            ->where('status', 'active')
            ->orderBy('id')
            ->get();

        // Get unique subjects
        $subjects = \App\Models\Subject::orderBy('name')
            ->pluck('name', 'id')
            ->toArray();

        // Get academic years
        $academicYears = SchoolClass::whereNotNull('academic_year')
            ->distinct()
            ->orderBy('academic_year', 'desc')
            ->pluck('academic_year')
            ->toArray();

        // Get grade levels for filter
        $gradeLevels = SchoolClass::distinct()
            ->orderBy('grade_level')
            ->pluck('grade_level')
            ->toArray();
---
select * from `teachers` where `status` = 'active' and `teachers`.`deleted_at` is null order by `id` asc
select * from `users` where `users`.`id` in (13)
select `name`, `id` from `subjects` order by `name` asc
select distinct `academic_year` from `school_classes` where `academic_year` is not null and `school_classes`.`deleted_at` is null order by `academic_year` desc
select distinct `grade_level` from `school_classes` where `school_classes`.`deleted_at` is null order by `grade_level` asc

    public function create()
    {
        // Debug: Get first user and see available columns
        $firstUser = User::first();
        if ($firstUser) {
            \Log::info('User attributes:', $firstUser->getAttributes());
            \Log::info('User columns:', array_keys($firstUser->getAttributes()));
        }

        // For now, get all active users
        $teachers = Teacher::with('user')->get();
---
select * from `users` limit 1
select * from `teachers` where `teachers`.`deleted_at` is null
select * from `users` where `users`.`id` in (13)