app/Http/Controllers/Admin/EnrollmentController.php

select * from `students` where `students`.`id` in (1) and `students`.`deleted_at` is null
select * from `users` where `users`.`id` in (14)
---
    public function index(Request $request)
    {
        $query = Enrollment::with(['student.user', 'class', 'enrolledBy'])
            ->latest();

        // Search filter
        if ($request->filled('search')) {
            $search = $request->search;
            $query->where(function ($q) use ($search) {
                $q->where('enrollment_id', 'like', "%{$search}%")
                    ->orWhereHas('student.user', function ($q) use ($search) {
                        $q->where('name', 'like', "%{$search}%")
                            ->orWhere('email', 'like', "%{$search}%");
                    })
                    ->orWhereHas('class', function ($q) use ($search) {
                        $q->where('name', 'like', "%{$search}%")
                            ->orWhere('code', 'like', "%{$search}%");
                    });
            });
        }

        // Status filter
        if ($request->filled('status')) {
            $query->where('status', $request->status);
        }

        // Class filter
        if ($request->filled('class_id')) {
            $query->where('class_id', $request->class_id);

select distinct `academic_year` from `school_classes` where `school_classes`.`deleted_at` is null
---

        $enrollments = $query->paginate(20);
        $classes = SchoolClass::active()->orderBy('name')->get();
        $academicYears = SchoolClass::distinct()->pluck('academic_year');

select * from `users` where `users`.`id` in (14)
---
    public function create(Request $request)
    {
        $students = Student::with('user')
            ->whereDoesntHave('enrollments', function ($query) use ($request) {
                $query->where('status', 'enrolled');
            })
            // Join with users table to order by user's name
            ->join('users', 'students.user_id', '=', 'users.id')
            ->orderBy('users.name')
            ->select('students.*') // Important: select only student columns
            ->get();

select * from `school_classes` where `school_classes`.`id` = '1' and `school_classes`.`deleted_at` is null limit 1
insert into `enrollments` (`student_id`, `class_id`, `enrollment_date`, `start_date`, `tuition_fee`, `notes`, `status`, `enrolled_by`, `balance`, `enrollment_id`, `updated_at`, `created_at`) values ('1', '1', '2026-01-04 00:00:00', '2026-01-04 00:00:00', '7000', null, 'enrolled', 1, 7000, 'ENR-695A9530121C8', '2026-01-04 16:28:32', '2026-01-04 16:28:32')
---
    public function store(Request $request)
    {
        $validated = $request->validate([
            'student_id' => [
                'required',
                'exists:students,id',
                Rule::unique('enrollments')->where(function ($query) use ($request) {
                    return $query->where('class_id', $request->class_id)
                        ->whereIn('status', ['pending', 'enrolled']);
                })
            ],
            'class_id' => 'required|exists:school_classes,id',
            'enrollment_date' => 'required|date',
            'start_date' => 'required|date',
            'tuition_fee' => 'nullable|numeric|min:0',
            'notes' => 'nullable|string|max:500',
        ]);

        // Check if class has available seats
        $class = SchoolClass::findOrFail($validated['class_id']);
        if (!$class->hasAvailableSeats()) {
            return back()->withInput()
                ->with('error', 'Class has reached maximum capacity. No seats available.');
        }

        DB::beginTransaction();

        try {
            $enrollment = Enrollment::create([
                'student_id' => $validated['student_id'],
                'class_id' => $validated['class_id'],
                'enrollment_date' => $validated['enrollment_date'],
                'start_date' => $validated['start_date'],
                'tuition_fee' => $validated['tuition_fee'] ?? $class->default_tuition_fee,
                'notes' => $validated['notes'],
                'status' => Enrollment::STATUS_ENROLLED,
                'enrolled_by' => auth()->id(),
            ]);

select * from `students` where `students`.`id` in (1) and `students`.`deleted_at` is null
select * from `users` where `users`.`id` in (14)
---
    public function show(Enrollment $enrollment)
    {
        $enrollment->load(['student.user', 'class', 'enrolledBy', 'approvedBy', 'transferredToClass']);