app/Http/Controllers/Admin/ExamController.php

select distinct `academic_year` from `exams` where `exams`.`deleted_at` is null order by `academic_year` desc
select * from `school_classes` where `school_classes`.`id` in (4) and `school_classes`.`deleted_at` is null
select * from `sections` where `sections`.`id` in (1) and `sections`.`deleted_at` is null
select * from `subjects` where `subjects`.`id` in (2)
---
    public function index(Request $request)
    {
        // Get unique academic years from exams
        $academicYearsFromDB = Exam::select('academic_year')
            ->distinct()
            ->orderBy('academic_year', 'desc')
            ->pluck('academic_year')
            ->toArray();

        // If no academic years in DB, generate default years
        $currentYear = date('Y');
        $defaultYears = [];
        for ($year = $currentYear; $year >= ($currentYear - 2); $year--) {
            $defaultYears[] = $year . '-' . ($year + 1);
        }

        // Merge and deduplicate
        $academicYears = array_unique(array_merge($academicYearsFromDB, $defaultYears));
        rsort($academicYears); // Sort in descending order

        // Query exams with filters
        $query = Exam::with(['schoolClass', 'section', 'subject'])
            ->latest();

        // Apply filters
        if ($request->filled('academic_year')) {
            $query->where('academic_year', $request->academic_year);
        }

        if ($request->filled('term')) {
            $query->where('term', $request->term);

select count(*) as aggregate from `exams` where `exams`.`deleted_at` is null
select count(*) as aggregate from `exams` where `is_published` = 1 and `exams`.`deleted_at` is null
select count(*) as aggregate from `exams` where `status` = 'scheduled' and `exams`.`deleted_at` is null
select count(*) as aggregate from `exams` where `status` = 'cancelled' and `exams`.`deleted_at` is null
---
        $exams = $query->paginate(20);

        // Get statistics
        $totalExams = Exam::count();
        $publishedExams = Exam::where('is_published', true)->count();
        $scheduledExams = Exam::where('status', 'scheduled')->count();
        $cancelledExams = Exam::where('status', 'cancelled')->count();

select * from `school_classes` where `school_classes`.`deleted_at` is null order by `name` asc
select * from `subjects` order by `name` asc
select * from `sections` where `sections`.`deleted_at` is null order by `name` asc
---
    public function create()
    {
        $classes = SchoolClass::orderBy('name')->get();
        $subjects = Subject::orderBy('name')->get();
        $sections = Section::orderBy('name')->get();

insert into `exams` (`name`, `type`, `academic_year`, `term`, `school_class_id`, `section_id`, `subject_id`, `exam_date`, `start_time`, `end_time`, `total_marks`, `passing_percentage`, `description`, `status`, `is_published`, `published_at`, `updated_at`, `created_at`) values ('1st Tutorial', 'weekly', '2025-2026', '1', '4', '1', '2', '2026-01-20 00:00:00', '2026-01-05 09:00:00', '2026-01-05 09:30:00', '100', '33', 'Accusantium culpa ni', 'ongoing', '1', '2026-01-05 01:39:36', '2026-01-05 01:39:36', '2026-01-05 01:39:36')
---
    public function store(Request $request)
    {
        // Validation
        $validated = $request->validate([
            'name' => 'required|string|max:255',
            'type' => 'required|string|max:255',
            'academic_year' => 'required|string|max:9',
            'term' => 'required|string|max:1',
            'class_id' => 'required|exists:school_classes,id',
            'section_id' => 'required|exists:sections,id',
            'subject_id' => 'required|exists:subjects,id',
            'exam_date' => 'required|date',
            'start_time' => 'required|date_format:H:i',
            'end_time' => 'required|date_format:H:i|after:start_time',
            'total_marks' => 'required|integer|min:1|max:1000',
            'passing_percentage' => 'nullable|integer|min:0|max:100',
            'description' => 'nullable|string',
            'status' => 'required|in:scheduled,ongoing,completed,cancelled',
            'is_published' => 'boolean',
        ]);

        // Handle published_at
        if ($request->has('is_published') && $request->is_published) {
            $validated['published_at'] = now();
        }

        // Create exam
        $exam = Exam::create($validated);