app/Http/Controllers/Admin/GuardianManagementController.php

select * from `users` where `users`.`id` in (10, 11, 12)
select `students`.*, `guardian_student`.`guardian_id` as `pivot_guardian_id`, `guardian_student`.`student_id` as `pivot_student_id`, `guardian_student`.`relationship_type` as `pivot_relationship_type`, `guardian_student`.`is_primary_contact` as `pivot_is_primary_contact`, `guardian_student`.`can_pickup` as `pivot_can_pickup`, `guardian_student`.`receive_reports` as `pivot_receive_reports`, `guardian_student`.`receive_notifications` as `pivot_receive_notifications`, `guardian_student`.`emergency_contact_priority` as `pivot_emergency_contact_priority`, `guardian_student`.`special_instructions` as `pivot_special_instructions`, `guardian_student`.`created_at` as `pivot_created_at`, `guardian_student`.`updated_at` as `pivot_updated_at` from `students` inner join `guardian_student` on `students`.`id` = `guardian_student`.`student_id` where `guardian_student`.`guardian_id` in (1, 2, 3) and `students`.`deleted_at` is null
select count(*) as aggregate from `guardians` where `guardians`.`deleted_at` is null
---
    public function index()
    {
        $guardians = Guardian::with(['user', 'students'])
            ->withCount('students')
            ->latest()
            ->paginate(10);