app/Http/Controllers/Admin/ReportController.php

select count(*) as aggregate from `students` where `students`.`deleted_at` is null
---
    public function index(Request $request)
    {
         $totalStudents = Student::count();
        try {
            $dateRange = $request->get('date_range', 7);
            $startDate = $this->getStartDate($dateRange, $request);

            // 1. Total Students
            $totalStudents = Student::count();

select * from `reports` order by `created_at` desc limit 5
---
            $subjectPerformance = $this->getSubjectPerformance($startDate);

            // 7. Recent Reports
            $recentReports = Report::orderBy('created_at', 'desc')->take(5)->get();

select count(*) as aggregate from `students` where `students`.`deleted_at` is null
select count(*) as aggregate from `students` where `created_at` < '2025-12-04 15:49:46' and `students`.`deleted_at` is null
---
    private function calculateStudentGrowth(): float
    {
        try {
            $currentCount = Student::count();
            $lastMonthCount = Student::where('created_at', '<', now()->subMonth())->count();

select COUNT(*) as total,
SUM(CASE WHEN status = 'present' OR status = 'Present' THEN 1 ELSE 0 END) as present from `student_attendances` where `attendance_date` >= '2025-12-28 15:49:46' limit 1
select COUNT(*) as total,
SUM(CASE WHEN status = 'present' OR status = 'Present' THEN 1 ELSE 0 END) as present from `student_attendances` where `attendance_date` between '2025-11-28 15:49:46' and '2025-12-28 15:49:46' limit 1
---
    private function getAttendanceData($startDate): array
    {
        try {
            // Check what columns exist in the attendance table
            $columns = Schema::getColumnListing('student_attendances');

            // Determine the status column name
            $statusColumn = in_array('attendance_status', $columns) ? 'attendance_status' : (in_array('status', $columns) ? 'status' : 'attendance');

            // Determine the date column name
            $dateColumn = in_array('attendance_date', $columns) ? 'attendance_date' : (in_array('date', $columns) ? 'date' : 'created_at');

            // Current period
            $currentAttendance = StudentAttendance::where($dateColumn, '>=', $startDate)
                ->selectRaw("COUNT(*) as total,
                    SUM(CASE WHEN $statusColumn = 'present' OR $statusColumn = 'Present' THEN 1 ELSE 0 END) as present")
                ->first();

            $currentTotal = $currentAttendance->total ?? 0;
            $currentPresent = $currentAttendance->present ?? 0;
            $currentPercentage = $currentTotal > 0 ? round(($currentPresent / $currentTotal * 100), 1) : 0;

            // Last period
            $lastStartDate = Carbon::parse($startDate)->subDays(30);
            $lastAttendance = StudentAttendance::whereBetween($dateColumn, [$lastStartDate, $startDate])
                ->selectRaw("COUNT(*) as total,
                    SUM(CASE WHEN $statusColumn = 'present' OR $statusColumn = 'Present' THEN 1 ELSE 0 END) as present")
                ->first();

select COUNT(*) as total,
SUM(CASE WHEN status = 'present' OR status = 'Present' THEN 1 ELSE 0 END) as present from `student_attendances` where date(`attendance_date`) = '2025-12-31' limit 1
---
    private function getAttendanceTrend(): array
    {
        try {
            $trend = [];

            for ($i = 4; $i >= 0; $i--) {
                $date = now()->subDays($i);

                $columns = Schema::getColumnListing('student_attendances');
                $statusColumn = in_array('attendance_status', $columns) ? 'attendance_status' : (in_array('status', $columns) ? 'status' : 'attendance');
                $dateColumn = in_array('attendance_date', $columns) ? 'attendance_date' : (in_array('date', $columns) ? 'date' : 'created_at');

                $dayAttendance = StudentAttendance::whereDate($dateColumn, $date)
                    ->selectRaw("COUNT(*) as total,
                        SUM(CASE WHEN $statusColumn = 'present' OR $statusColumn = 'Present' THEN 1 ELSE 0 END) as present")
                    ->first();

select * from `subjects`
select * from `exam_results` where `subject_id` = 1 and `created_at` >= '2025-12-28 15:49:46' and `exam_results`.`deleted_at` is null
---
    private function getSubjectPerformance($startDate): array
    {
        try {
            if (!Schema::hasTable('subjects') || !class_exists(Subject::class)) {
                throw new \Exception('Subjects table not found');
            }

            $subjects = Subject::all();
            $performance = [];

            foreach ($subjects as $subject) {
                // Get exam results for this subject
                $results = ExamResult::where('subject_id', $subject->id)
                    ->where('created_at', '>=', $startDate)
                    ->get();

select * from `exam_results` where `created_at` >= '2025-12-28 15:49:46' and `exam_results`.`deleted_at` is null
select * from `exam_results` where `created_at` between '2025-11-28 15:49:46' and '2025-12-28 15:49:46' and `exam_results`.`deleted_at` is null
---
    private function getExamPerformance($startDate): array
    {
        try {
            if (!Schema::hasTable('exam_results')) {
                throw new \Exception('Exam results table not found');
            }

            // Use your existing structure
            $currentResults = ExamResult::where('created_at', '>=', $startDate)->get();

            $currentTotal = $currentResults->count();
            $currentPassed = $currentResults->where('is_passed', true)->count();
            $currentPercentage = $currentTotal > 0 ? round(($currentPassed / $currentTotal * 100), 1) : 0;

            // Last period
            $lastStartDate = Carbon::parse($startDate)->subDays(30);
            $lastResults = ExamResult::whereBetween('created_at', [$lastStartDate, $startDate])->get();