app/Http/Controllers/Admin/StudentManagementController.php

select * from `school_classes` where `school_classes`.`id` in (2) and `school_classes`.`deleted_at` is null
select * from `sections` where `sections`.`id` in (1) and `sections`.`deleted_at` is null
select * from `students` where `students`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `students` where `students`.`deleted_at` is null
select * from `users` where `users`.`id` in (14)
select * from `school_classes` where `school_classes`.`deleted_at` is null
---
    public function index(Request $request)
    {
        // Get filter parameters
        $status = $request->get('status');
        $search = $request->get('search');
        $classFilter = $request->get('class_id');

        // Build query with filters
        $students = Student::with('user', 'user.roles', 'schoolClass','section')
            ->when($status, function ($query, $status) {
                return $query->where('status', $status);
            })
            ->when($classFilter, function ($query, $classId) {
                return $query->where('class_id', $classId);
            })
            ->when($search, function ($query, $search) {
                return $query->where(function ($q) use ($search) {
                    // Search in student-specific fields
                    $q->where('student_id', 'like', "%{$search}%")
                        ->orWhere('admission_number', 'like', "%{$search}%")
                        // Search in user fields
                        ->orWhereHas('user', function ($userQuery) use ($search) {
                            $userQuery->where('email', 'like', "%{$search}%")
                                ->orWhere('phone', 'like', "%{$search}%")
                                ->orWhere('name', 'like', "%{$search}%");
                        });
                });
            })
            ->orderBy('created_at', 'desc')
            ->paginate(10)
            ->withQueryString();

        // Get classes for filter dropdown
        $classes = SchoolClass::all();

insert into `users` (`name`, `email`, `password`, `phone`, `avatar`, `address`, `status`, `updated_at`, `created_at`) values ('Randall Ellis', 'bizoxe@mailinator.com', '$2y$12$6bnY8XlA9XgMneRS67JgSeL3J7GzeuxcS4g0Vco/KRsbMF2qRgRJe', '+1 (506) 201-6408', 'avatars/users/user_1767543959_695a949770742.png', 'Est ipsa minima qu', 'active', '2026-01-04 16:26:00', '2026-01-04 16:26:00')
---


            // Create User account
            $user = User::create([
                'name' => $userValidation['first_name'] . ' ' . $userValidation['last_name'],
                'email' => $userValidation['email'],
                'password' => Hash::make($userValidation['password']),
                'phone' => $userValidation['phone'] ?? null,
                'avatar' => $userAvatarPath,
                'address' => $userValidation['address'] ?? null,
                'status' => $userValidation['status'],
            ]);

insert into `students` (`user_id`, `student_id`, `class_id`, `section_id`, `admission_number`, `date_of_birth`, `gender`, `blood_group`, `nationality`, `religion`, `caste`, `address`, `city`, `state`, `postal_code`, `country`, `emergency_contact_name`, `emergency_contact_phone`, `emergency_contact_relation`, `admission_date`, `grade_level`, `roll_number`, `academic_year`, `avatar`, `medical_notes`, `allergies`, `medications`, `transport_route`, `special_instructions`, `status`, `is_boarder`, `uses_transport`, `updated_at`, `created_at`) values (14, 'S0001', '2', '1', 'ADM20260001', '2015-06-09 00:00:00', 'male', 'AB-', 'Sint adipisci id ne', 'Quo eiusmod omnis in', 'Perspiciatis aut ne', 'Est ipsa minima qu', 'Id blanditiis ea ne', 'Est excepturi nobis', 'Voluptatem Quidem r', 'Eum culpa aliquid e', 'Felix Hebert', '+1 (368) 936-1274', 'Ratione qui ea facer', '1990-09-10 00:00:00', 'Grade 9', '45', '1996', 'avatars/students/student_1767543959_695a94977ab5e.png', 'Perferendis aliquam', '[\"Adipisci est aut sim\"]', '[\"Ratione eu quia sed\"]', 'Quam sed voluptate i', 'Enim lorem adipisici', 'active', 1, 1, '2026-01-04 16:26:00', '2026-01-04 16:26:00')
---
                'uses_transport' => $request->has('uses_transport') ? true : false,
            ];

            $student = Student::create($studentData);