app/Http/Controllers/Admin/SubjectManagementController.php

    public function index(Request $request)
    {
        $query = Subject::query();

        if ($request->has('search') && $request->search != '') {
            $query->where(function ($q) use ($request) {
                $q->where('name', 'like', '%' . $request->search . '%')
                    ->orWhere('code', 'like', '%' . $request->search . '%');
            });
        }

        if ($request->has('category') && $request->category != '') {
            $query->where('category', $request->category);
        }

        if ($request->has('is_active') && $request->is_active != '') {
            $query->where('is_active', $request->is_active);
        }

        $subjects = $query->latest()->paginate(10);
---
select * from `subjects` where `category` = 'core' and `is_active` = '1' order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `subjects` where `category` = 'core' and `is_active` = '1'

    public function store(Request $request)
    {
        // Debug: Check if request data is coming through
        // dd($request->all());

        $validated = $request->validate([
            'name' => 'required|string|max:255',
            'code' => 'required|string|max:50|unique:subjects',
            'description' => 'nullable|string',
            'category' => 'required|in:core,elective,extracurricular,vocational',
            'credit_hours' => 'required|integer|min:1|max:10',
            'difficulty_level' => 'required|integer|min:1|max:5',
            'is_active' => 'sometimes|boolean'
        ]);

        // Debug: Check validated data
        // dd($validated);

        try {
            // Handle checkbox boolean value
            $validated['is_active'] = $request->has('is_active');

            $subject = Subject::create($validated);
---
insert into `subjects` (`is_active`, `credit_hours`, `name`, `code`, `description`, `updated_at`, `created_at`) values (1, '9', 'Price Landry', 'Sub-01', 'Modi magna illum ev', '2026-01-05 01:36:27', '2026-01-05 01:36:27')