app/Http/Controllers/Admin/TeacherManagementController.php

    public function index()
    {
        $teachers = Teacher::with('user', 'department')->paginate(10);

        $totalTeachers = Teacher::count();
        $activeTeachers = Teacher::where('status', 'active')->count();
        $pendingTeachers = Teacher::where('status', 'pending')->count();
        $inactiveTeachers = Teacher::where('status', 'inactive')->count();
---
select * from `departments` where `departments`.`id` in (3)
select * from `teachers` where `teachers`.`deleted_at` is null limit 10 offset 0
select * from `users` where `users`.`id` in (13)
select count(*) as aggregate from `teachers` where `teachers`.`deleted_at` is null
select count(*) as aggregate from `teachers` where `status` = 'active' and `teachers`.`deleted_at` is null
select count(*) as aggregate from `teachers` where `status` = 'pending' and `teachers`.`deleted_at` is null
select count(*) as aggregate from `teachers` where `status` = 'inactive' and `teachers`.`deleted_at` is null

    public function create()
    {
        $roles = Role::all();
        $departments = Department::all();
---
select * from `roles`
select * from `departments`


            \Log::info('Step 5: Creating user');
            // Create User account
            $user = User::create([
                'name' => $userValidated['first_name'] . ' ' . $userValidated['last_name'],
                'email' => $userValidated['email'],
                'password' => Hash::make($userValidated['password']),
                'phone' => $userValidated['phone'] ?? null,
                'status' => $userValidated['status'],
                'avatar' => $userAvatarPath,
            ]);
---
insert into `users` (`name`, `email`, `password`, `phone`, `status`, `avatar`, `updated_at`, `created_at`) values ('Medge Vincent', 'xixydevys@mailinator.com', '$2y$12$ek270Fx1/6xLZ3MFlY8d7ePR2cwm22m2vjDpVNa9TiM8udIYBv7SO', '+1 (779) 747-7167', 'active', 'avatars/users/user_1767543907_695a94635b2f5.png', '2026-01-04 16:25:08', '2026-01-04 16:25:08')