app/Http/Controllers/Admin/UserManagementController.php

    public function index(Request $request)
    {
        // Get filter parameters
        $roleFilter = $request->get('role');
        $status = $request->get('status');
        $search = $request->get('search');

        // Build query with filters
        $users = User::query()
            ->when($roleFilter, function ($query, $roleFilter) {
                return $query->whereHas('roles', function ($q) use ($roleFilter) {
                    $q->where('name', $roleFilter);
                });
            })
            ->when($status, function ($query, $status) {
                return $query->where('status', $status);
            })
            ->when($search, function ($query, $search) {
                return $query->where(function ($q) use ($search) {
                    $q->where('name', 'like', "%{$search}%")
                        ->orWhere('email', 'like', "%{$search}%");
                });
            })
            ->with('roles')
            ->orderBy('created_at', 'desc')
            ->paginate(10)
            ->withQueryString();
---
select * from `users` order by `created_at` desc limit 10 offset 10
select count(*) as aggregate from `users`

        // Calculate statistics
        $stats = [
            'totalUsers' => User::count(),
            'activeUsers' => User::where('status', 'active')->count(),
            'adminUsers' => User::role('admin')->count(),
            'teacherUsers' => User::role('teacher')->count(),
            'studentUsers' => User::role('student')->count(),
            'parentUsers' => User::role('guardian')->count(),
            'pendingUsers' => User::where('status', 'pending')->count(),
            'inactiveUsers' => User::where('status', 'inactive')->count(),
        ];

        // Get available roles for filter
        $roles = Role::all();
---
select count(*) as aggregate from `users` where `status` = 'active'
select count(*) as aggregate from `users`
select count(*) as aggregate from `users` where `status` = 'pending'
select count(*) as aggregate from `users` where `status` = 'inactive'
select * from `roles`

    public function edit(User $user)
    {
        $roles = Role::all();
---
select * from `roles`

                'avatar' => $userAvatarPath ?? $user->avatar,
            ];

            $user->update($updateData);
---
update `users` set `avatar` = 'avatars/users/user_1767578488_695b1b785a777.png', `users`.`updated_at` = '2026-01-05 02:01:28' where `id` = 1